/* Ляхович Д.А.
 * 17-ИТд
 * Вариант 8
 *
 * Объектно-ориентированные технологии программирования и стандарты проектирования
 * Лабораторная №4
 * Задание 1
 * Порядок выполнения работы.
 *  1. Создать шаблон заданного класса. Определить конструкторы, деструктор, перегруженную операцию присваивания (“=”) и операции, заданные в варианте задания.
    Класс − множество set. Дополнительно перегрузить следующие операции:
    + − добавить элемент в множество (типа set+item);
    * − пересечение множеств;
    int()− мощность множества.
 *  2. Написать программу тестирования, в которой проверяется использование шаблона для стандартных типов данных.
 *  3. Выполнить тестирование.
 *  4. Определить пользовательский класс, который будет использоваться в качестве параметра шаблона. Определить в классе необходимые функции и перегруженные операции.
 *  5. Написать программу тестирования, в которой проверяется использование шаблона для пользовательского типа.
 *  6. Выполнить тестирование.
 *  7. Реализовать версии на C#, Java.
 */

using System;

namespace task_1_cs {
  class Program {
    static void Main(string[] args) {
      
      
      Console.WriteLine("Hello World!");
    }
  }
}
