/* Ляхович Д.А.
 * 17-ИТд
 * Вариант 8
 *
 * Операционые системы и системное программрование
 * Лабораторная №1
 * Задание 7
 * Написать простейшую программу на языке Си которая выводи фамилию студента, скомпилировать и скомпоновать ее утилитой gcc.
 */

#include <stdio.h>

int main(int argc, char const *argv[]) {
  printf("Ляхович Д.А.\n");

  return 0;
}
